[
{"asin": "B0897WZSZ6", "text": "I rarely take the time to write reviews, but this is a big ticket item for most people.I have nothing bad to say regarding the particular XPS 9500 unit I received with a couple of caveats...The Bad:Similar to other reviewers, I suspect this product is not \"NEW\" as described but rather returned and/or refurbished. It came in a rather torn up box which was simply sealed with regular packing tape. It was shipped to Amazon from a company that appears to be an authorized reseller/or refurbishing center as far as I could tell from a quick Google search. The box had certainly been around the block a time or two, LOL.Given the price point and specs, I'm not surprised if it is a \"refurb, open box, return, etc.\" I'm only surprised that Amazon sells them at a steep discount but describes as \"NEW\". I could be way off base here, and perhaps Dell ships most of their products in beat up boxes, and I'm just unaware of it.The Good:I know the above sounded very critical, but bear with me. Once I opened the outer box, the inner Dell box was pristine. Everything was nicely packaged and appeared brand new. The usual protective plastic peel off, unwrap, etc. stuff was all there on everything. There wasn't a fingerprint or speck of dust to be found.  Even smelled \"like new\". So...I figured I'd give it a go. Set it up and everything seemed fine, so I opened it up and upgraded memory to 64gb. Everything internally looked new to my untrained eye as well.  I've been using it for several days with no issues. Overall, I personally am happy for the price, but if these aren't truly \"new\", I think description should reflect that.Considerations:My laptop before this one was an XPS 15 2012 or 2013 model. It originally had Windows 8 on it FWIW. I had upgraded to SSD, switched to Win10, maxed out RAM, and replaced battery over the years...Just so you know my basis for comparison.Other reviews on both Amazon and online mention crackling speakers and faulty trackpads with this model.  My experience has been that speakers sound as good as any laptop I've ever heard, and trackpad is slightly less sensitive in top corners but otherwise fine (I never would have noticed trackpad thing except for online reviews had me looking for faults.) I personally find the speakers and trackpad perfectly fine. Another criticism has been loud fan noise when laptop is trying to cool.  It doesn't bother me because my old XPS sounds like a turbo spooling up when it's under a load too! Maybe other brands are quieter, IDK. Fan noise wasn't a big concern of mine.Perhaps mine was a return/refurb that had faults addressed, I just got lucky and got a good unit, or the faults aren't as bad as they are made out to be with this model. I can't say for certain, but that's my experience thus far and honest review.", "title": "Overall happy with this (XPS 15/9500) so far!", "location_and_date": "Reviewed in the United States 🇺🇸 on October 28, 2020", "verified": true, "rating": "4.0"},
{"asin": "B0897WZSZ6", "text": "This laptop is fantastic, and overall I am very satisfied with this purchase.  But let's talk about the elephant in the room that a few reviewers have already pointed out: \"Is this a new product?\".  Given the $2000 price tag, it's only natural to be concerned about the integrity of the product you are receiving.  I understand that entirely as I was very concerned myself.For me, the laptop itself was inside its original packaging and showed no signs of being opened before.  With that said, the box was a little banged up upon arrival.  The laptop itself was wrapped around plastic, and everything inside seemed in place.Now, there is a shipping label on the original packaging box from \"Dell Returns\" located in Lebanon, Tennessee.  So I did some quick investigating.  I read that most returns for Dell products will get shipped to this Return Center in Lebanon, Tennessee.  These returns include order cancellations and unopened returns.  Dell Outlet, in turn, sells these \"new unused\" products at a cheaper price tag.  So yes, I believe this product is \"NEW\", but it is new under the Dell Outlet standards.  This is just my assumption but is the most logical reason I can think of.For me, I have no problem receiving a Dell Outlet product, but it should at least be advertised as such on Amazon.  Now, considering all of these factors and even if this is a Dell Outlet product, getting a Dell XPS 15 (2020 model) at this price (~$2000) is a STEAL!  You are getting Dell's UHD+ touchscreen infinity display, latest i7 CPU, 1 TB of SSD storage, and Windows 10 Pro.  If you were buying this same laptop configuration off of Dell's official website, it run you close to ~$2500.  On top of the cheaper price tag on Amazon, there is a 10% back for customers who purchase this laptop on a Amazon Prime Visa card (~$200 back).The laptop itself has solid specs and is built very solidly.  The aluminum casing and carbon fiber finish gives this laptop a premium feel.  The display is gorgeous and crisp.  The touchscreen is super responsive.  The track pad is honestly the best I have experienced on any Windows laptop.  I personally have NOT had the wobbly track pad issue some users were having.Some issues I do have with the laptop is that it does heat up quite a bit, and you can hear the fans spinning pretty hard at times. Dell has a weird adaptive brightness feature, but you can easily turn this off in the settings.  Battery life is less than impressive when you are doing more intensive tasks.  I hear the pre-installed McAfee software plays a role in draining the battery, so you could disable it and use the built-in Windows Defender.  And while I love the carbon fiber finish (because it gives it an even more premium feel), it is definitely a fingerprint magnet lol.All in all, this laptop is absolutely stunning.  The amount of features you receive for the price that you buy this laptop at outweighs the minor issues that I have pointed out.", "title": "THE BEST WINDOWS LAPTOP OF 2020!", "location_and_date": "Reviewed in the United States 🇺🇸 on August 6, 2020", "verified": true, "rating": "4.0"},
{"asin": "B0897WZSZ6", "text": "As others have mentioned, the trackpad is atrocious and this computer has some serious temperature control issues. I actually bought this computer specifically for its large trackpad. Having used various MacBooks as my personal computer for the last decade plus, I’ve gotten very used to never carrying around a mouse and keyboard with me, due to the MacBook’s fantastic trackpad. So, when I was told I’d need a Windows laptop for work, I chose this one specifically for its large trackpad. Unfortunately, the trackpad is completely unusable. Unlike others, mine actually has no wobble to it, but it is incredibly erratic and inconsistent in response. The mouse hiccups and stutters all over the place when using the trackpad, whereas it’s super smooth when using a mouse. Luckily, I use a dock with mouse and keyboard most of the time when I’m in my office at work.Hilariously, the Dell dock I purchased with it doesn’t actually work correctly, as I get a warning every single time the computer boots up telling me the dock it’s plugged into is not to correct spec to provide full power and functionality, despite it being the dock Dell sells for this very computer (the highest watt one). It works fine, honestly, but I get hit with the error constantly because this computer is ALWAYS shutting down due to low battery power overnight, despite putting it into hibernate (not sleep) mode every night before I put it in my bag. The battery life in general is not great, but the fact that neither sleep nor hibernate mode will prevent it from dying overnight is unacceptable.Perhaps worst of all, for most people anyway, this thing has really serious temperature control problems. It frequently sounds like a jet engine (PS4 Pro owners will know the sound well) while performing pretty simple tasks (like using Microsoft Office apps or browsing the web) and more intensive tasks require messing around with the power and fan settings to avoid the computer suddenly going black from overheating, something I experienced many times when I tried to play Civ 6 on it.I truly cannot believe that this laptop costs what it does and has the reviews it does, because it is borderline unusable for many applications. Unfortunately, I cannot afford to be without a work computer for long enough to have it looked at, so I’m stuck with this thing until it drives me crazy enough to buy something else.Two stars (instead of just one) simply because it does have a really nice screen.", "title": "Terrible trackpad, battery life, and temperature control", "location_and_date": "Reviewed in the United States 🇺🇸 on January 6, 2022", "verified": true, "rating": "2.0"},
{"asin": "B0897WZSZ6", "text": "Dell XPS 15 9500This is a magnificent 15.6 in laptop created for the creative professional. It is capable of gaming but does not accel in that field. The version I selected has the following hardware:- i7 10750H- GTX 1650 ti- 16GB RAM- 1TB SSD-86 WHr battery (good for 8-9 hours of normal internet surfing)Appearance:-The dimensions of this laptop are: H= .71” (18mm) W= 13.57” (344.72mm) D= 9.06” (230.14mm). It is 4.5 lbs (2.05 kg).-The chassis is made of CNC aluminum. The dell logo in the center of the lid is glossy.-The palm wrest is a soft black carbon fiber with a touchpad is 5.9” x3.5” which is similar to that of a MacBook.Display-The laptop has a 16:10 infinity-edge display. This means that where are almost no bezels on this screen at all. My model has a 3840x2400 screen with VESA certifiedHDR400 sporting a 500nit display. It has 100% Adobe RGB and 94% DCI-P3 color gamut.GTG so finishing quickly:Features:-Windows hello (facial recognition)-Finger print scanner-720p camera on top of display-nice IO with 2 thunderbolt 3 ports on the left along with a Kensington lock slot and on the right a USB-C with charging capabilities, a headphone jack and a SD card slot on the right.-The laptop comes with an adapter allowing you to use an HDMI or USB-type A device.-laptop has WiFi and Bluetooth connectivity***Note***-The first batch of this product had a touchpad wobble that may also click unintentionally. Mine did not have this issue.-The McAfee free antivirus that comes with the computer greatly increases the drain of battery life. I recommend removal.", "title": "Impressive for creative work not gaming.", "location_and_date": "Reviewed in the United States 🇺🇸 on October 30, 2020", "verified": true, "rating": "5.0"},
{"asin": "B0897WZSZ6", "text": "I've included the laptop configuration to be sure. I saw one review unrelated to this specific laptop in the mix.New Dell XPS 15 9500 15.6 inch UHD+ Touchscreen Laptop (Silver) Intel Core i7-10750H 10th Gen, 16GB DDR4 RAM, 1TB SSD, Nvidia GTX 1650 Ti with 4GB GDDR6, Window 10 Pro (XPS9500-7845SLV-PUS)I received my laptop on 10/1. But I was too nervous about opening the package after having read several negative reviews about the trackpad. Finally, I opened the box a few days later because I was curious to see what I had bought.Like in several other reports, the first thing I noticed was the Dell returns label. So that was the first red flag. And just for that, I was ready to seal the box and send it back. But then I decided to check out the trackpad. If it turned out to be okay, then I would keep the machine.After powering on the laptop, I tested the trackpad in every way possible by pressing and clicking. I wanted to know if I would get the wobble or rattle effect that others have experienced. I didn't. But as I tested out the trackpad, I noticed something else--the erratic cursor movement.No matter how hard I tried moving the cursor, it had a mind of its own. It would not go in the directions I wanted. So I quickly Googled and found that it was also another issue others have reported. One even mentioned Dell sending a technician to replace the trackpad.I don't have an issue buying a \"refurbished\" laptop, given that the seller had stated in the descriptions clearly. But Dell wasn't willing to do that, of course. They needed to rid as many of the problematic units as possible. I knew the price was too low to be true. I had even compared it with the same configuration on Dell's website.Too bad. The laptop even got the thumbs up from many YouTube reviewers as one of the top-notch video editing computers. I didn't have the time to look for other potential flaws. So I packaged it the same day and sent it back.I finally received my refund nearly three weeks later. Not sure why it took that long to process. I vaguely remember someone else mentioning the slow refund as well.Dell has lost my confidence in buying their laptops online. So off to the other reputable sellers I go!", "title": "Buy at Your Own Risk", "location_and_date": "Reviewed in the United States 🇺🇸 on October 26, 2020", "verified": true, "rating": "1.0"},
{"asin": "B0897WZSZ6", "text": "I was a little nervous reading reviews that stated that computers come used, not working etc. I can confirm that Amazon delivered to me a pristine machine - working perfectly, is new and exactly to the spec Amazon advertised. Very happy with the purchase. I purchased UHD+ Touchscreen 10th gen i7 - the screen is perfect, on par or better than new MacBook Pro that I also use. Overall new XPS 15 is well designed, solid machine with fast processor and outstanding UHD+ screen. I also like that I can upgrade it to 64GB or RAM for about $300 (2933MHz DDR4 CL17 SODIMM Laptop Memory).P.S. For non technical people, please run both Dell updater (lots of drivers / bios updates there) and Windows updates.", "title": "Fantastic machine. Delivered as promised", "location_and_date": "Reviewed in the United States 🇺🇸 on June 26, 2020", "verified": true, "rating": "5.0"},
{"asin": "B0897WZSZ6", "text": "First Dell for a few years and I just love the quality of the build. Amazing screen resolution. Bought 16GB or Ram and 1T hard drive. Lots of room to expand later up to 64GB of Ram and another hard drive slot if needed. I always try to 'future proof' my purchases and this fits the bill.Not the lightest machine around but a perfect size for photographic work - still highly portable but big enough to see my work.Like the keyboard and mouse pad and have had none of the issues others have mentioned.", "title": "Amazingly well built machine by Dell", "location_and_date": "Reviewed in the United States 🇺🇸 on November 27, 2020", "verified": true, "rating": "5.0"},
{"asin": "B0897WZSZ6", "text": "I don't normally write reviews, but I just wanted to report that this machine came in absolutely perfect. No touchpad issues, nothing negative whatsoever. I am highly critical of laptops, being a cloud architect. I can detect absolutely nothing wrong with this piece. I was highly concerned that the touchpad would wobble etc but nope, perfect. It's the first touchpad I've ever used that rivals a MacBook. It's actually big enough to perform the three and four-finger gestures that are now built in to windows 10. Touchscreen is sublime. Keyboard: no complaints. It's just great all around.", "title": "Perfect Machine", "location_and_date": "Reviewed in the United States 🇺🇸 on October 21, 2020", "verified": true, "rating": "5.0"},
{"asin": "B0897WZSZ6", "text": "I'm an IT guy so having a machine that is powerful but agile is important to me.  I upped the RAM to 32Gb of DDR4-2933.  Since it does not do XMP, DDR4-3200 will not run full speed.  But that's OK by me, it performs great.  I'm glad I waited for the Windows Hello camera built-in.  Make sure you have USB-C devices or adapters for other peripherals.  It does come with one adapter also.  You won't go wrong with this laptop.", "title": "Love this laptop", "location_and_date": "Reviewed in the United States 🇺🇸 on August 18, 2020", "verified": true, "rating": "5.0"},
{"asin": "B0897WZSZ6", "text": "The media could not be loaded.\n                \n            \n                \n            \n            \n        \n    \n    \n\n\n\n\n\n\n\n\n  \n  \n     The laptop is gorgeous but beware of the touchpad as it wobbles and has like a false click when you're using it; this is by now a known issue and my unit was affected by it. I'm evaluating my replacement options right now but it seems it's hard to get an unit without this or worse issues.Update1: Dell wants to replace the part with an on-site technician visit but they are backordered. Will update this review if this works.Update2: Almost 30 days after purchase and 20 days since contacting support Dell has not scheduled the technician visit as the order is backordered. Beware when buying this laptop, a lot of them present this issue.Update3: I have received 3 units of this laptop so far (two replacements). The QA is really bad, they all had touchpad or screen issues, the latest one having flex to click issues (google: \"flex to click xps 9500\"). BTW the technician visit on update2 was never scheduled and the ETA was moved up twice. If you're picky with touchpads or quality of your purchases don't buy this model. Reducing my review to one star.", "title": "Almost perfect but killer touchpad wobble. Beware of Dell support.", "location_and_date": "Reviewed in the United States 🇺🇸 on July 18, 2020", "verified": true, "rating": "1.0"}
]