[
{"asin": "B0B3C5HNXJ", "text": "I really like this MacBook Pro! Came in original box had no cosmetic or visible issues. Powered up great. I updated OS and when I went to add AppleCare it had a purchase date of a few months earlier. I called apple and had it resolved in about 20 minutes. MacBook works great. Seems to be brand new!", "title": "Acceptable MacBook Pro from warehouse", "location_and_date": "Reviewed in the United States 🇺🇸 on March 12, 2023", "verified": true, "rating": "5.0"},
{"asin": "B0B3C5HNXJ", "text": "It is super light, super fast and as always looks great!", "title": "Love this MacBook!", "location_and_date": "Reviewed in the United States 🇺🇸 on March 19, 2023", "verified": true, "rating": "5.0"},
{"asin": "B0B3C5HNXJ", "text": "I liked it, just couldn't figure out the USB port but someone helped me. This is being used for DJ purpose for now", "title": "Cancel the return, I'm keeping it", "location_and_date": "Reviewed in the United States 🇺🇸 on March 14, 2023", "verified": true, "rating": "5.0"},
{"asin": "B0B3C5HNXJ", "text": "I would just like to point out that shipping was VERY quick . I was expecting it 7 days after I ordered… got it in 2 ! Just keep in mind , this package requires a signature so plan on being homeI bought mine under “new” so I was very impressed to see the packaging was intact and damage free. Start up and set up was a breeze. I’ve never had a MacBook so I’m still looking around on how things work but other.The company was quick to respond with any questions I had.", "title": "Perfect Condition and Fast Shipping", "location_and_date": "Reviewed in the United States 🇺🇸 on February 10, 2023", "verified": true, "rating": "5.0"},
{"asin": "B0B3C5HNXJ", "text": "This is an incredible laptop. The laptop is sleek and sophisticated with incredible ease of use. I am impressed with the design and the function is as perfect as you’d expect an apple product to be. I highly recommend this product.", "title": "Great laptop", "location_and_date": "Reviewed in the United States 🇺🇸 on February 22, 2023", "verified": true, "rating": "5.0"},
{"asin": "B0B3C5HNXJ", "text": "I use it solely for recording music in my drum studio. Fast, clean and easy to use. Love it.My only potential complaint is I had to purchase a hub to increase my USB-C inputs but no issues there.", "title": "Excellent MacBook Pro", "location_and_date": "Reviewed in the United States 🇺🇸 on February 23, 2023", "verified": true, "rating": "5.0"},
{"asin": "B0B3C5HNXJ", "text": "la compre porque queria una nueva y si es muybuena , yo tengo la version antigua y la verdad el tactil si es un plus a la laptop .", "title": "Me gusto mucho", "location_and_date": "Reviewed in the United States 🇺🇸 on February 24, 2023", "verified": true, "rating": "5.0"},
{"asin": "B0B3C5HNXJ", "text": "MAC is the best!!! Wouldn’t use anything else.have fun!!Thank you from Audrey!!!", "title": "Finally got a new MAC", "location_and_date": "Reviewed in the United States 🇺🇸 on March 5, 2023", "verified": true, "rating": "5.0"},
{"asin": "B0B3C5HNXJ", "text": "As always. Apple always works. Shipping was quick.", "title": "Apple Mac book Pro", "location_and_date": "Reviewed in the United States 🇺🇸 on March 10, 2023", "verified": true, "rating": "5.0"},
{"asin": "B0B3C5HNXJ", "text": "Get yours now :)", "title": "Love the product!", "location_and_date": "Reviewed in the United States 🇺🇸 on March 8, 2023", "verified": true, "rating": "5.0"},
{"asin": "B0B3C5HNXJ", "text": "Sleek and simple design- quick running speed and super user friendly!", "title": "Love this MacBook Pro!", "location_and_date": "Reviewed in the United States 🇺🇸 on February 25, 2023", "verified": true, "rating": "5.0"},
{"asin": "B0B3C5HNXJ", "text": "Calidad calidad", "title": "Me encanta", "location_and_date": "Reviewed in the United States 🇺🇸 on February 18, 2023", "verified": true, "rating": "5.0"},
{"asin": "B0B3C5HNXJ", "text": "Gorgeous computer but not the easiest to get stared with, for me...  Being not like my last Mac which was open lid and start computing, I had a terrible time getting the computer to work...  I opened the lid to an unfamiliar series of screens, needing to be filled out, in order to be able to use it...  After an hour of trying to get through the screens, I realized I would need an Apple employee to get me through them...  Thereby necessitating me to go to the only Apple store near me which was in a huge shopping center...  Being wheelchair bound, large shopping centers are a nightmare for me...  If you are like me, technically challenged at times, get some assistance first...", "title": "BEAUTIFUL COMPUTER WITH ONLY ONE DRAW-BACK...", "location_and_date": "Reviewed in the United States 🇺🇸 on December 24, 2022", "verified": true, "rating": "5.0"},
{"asin": "B0B3C5HNXJ", "text": "Super fast boot time on this MacBook Pro, with great extra storage (1 TB internal drive) with extra RAM (16G), this year’s model 2022 with M2 chip. I couldn’t seem to find these options on the Apple store’s own site, which I wanted to buy from, but if they won’t offer it, I’m glad at least Amazon does.A word to buyers about the newer MacBooks running OS Monterey: there appears to be consistent problems with lines showing up on the screen, either horizontal or vertical, when the system is switching between apps and windows. I had this problem with a late 2016 model and now I see a faint trace of this same problem with this BRAND NEW 2020 model. Bummer. It appears to be a common problem, if you do a Google search. What are ya doing, Apple?I’m still happy with purchase. Looking forward to an update that will fix the screen line issue though.", "title": "Nice", "location_and_date": "Reviewed in the United States 🇺🇸 on November 3, 2022", "verified": true, "rating": "4.0"},
{"asin": "B0B3C5HNXJ", "text": "Battery life when I first got it was not 100% battery life. Says normal not excellent.", "title": "The computer is great, although the battery life is not as if new!", "location_and_date": "Reviewed in the United States 🇺🇸 on January 7, 2023", "verified": true, "rating": "4.0"},
{"asin": "B0B3C5HNXJ", "text": "It's been a while since I've had a new computer but I like the smaller, lighter, faster MacBook Pro. I was surprised to find it does not have a way to run a DVD so I purchased a attachment. Otherwise, so far so good, I do photography so I purchased Photoshop Elements I have not utilized that as yet, we'll see how that goes in the future.", "title": "13\" MacPro", "location_and_date": "Reviewed in the United States 🇺🇸 on December 3, 2022", "verified": true, "rating": "4.0"},
{"asin": "B0B3C5HNXJ", "text": "", "title": "Like new 🙏", "location_and_date": "Reviewed in the United States 🇺🇸 on February 3, 2023", "verified": true, "rating": "5.0"},
{"asin": "B0B3C5HNXJ", "text": "The MacBook Pro with the M2 processor is somewhat faster than my MacBook Pro with a M1 processor.  The system is compatible with my software and my peripheral devices. It replaces a well-loved, well-used MacBook Air from 2015. Its limited I/O capabilities really get in the way. such a disappointment. Apple clearly is focused on form over function.Unlike the earlier system, this system only has two ports for peripheral devices and charging.  So, if you'd like to attach a power cord, a time machine drive, and anything else, you need to purchase a USB-C docking station.  What a pain!Since previous generations of Time Machine devices used USB-A connectors and this machine doesn't have one, setting up the machine is much, much more painful than necessary.  One has to purchase and received a dongle to attach a USB-A device.Furthermore, all of the dongles I've purchased over the years to attach devices need to be purchased again because they support lightening, USB-A or Micro USB rather than USB C.The transport company didn't communicate with me about the delivery and expected me to sit at home for 12 hours waiting for the driver to arrive so that I could accept the box and sign for it.  UPS does not provide usable tracking information for the day of delivery.All-in-all, I like the machine, but I/O limitations are a constant irritation.", "title": "Disappointing system having limited I/O capabilities, transport company event worse.", "location_and_date": "Reviewed in the United States 🇺🇸 on December 3, 2022", "verified": true, "rating": "3.0"},
{"asin": "B0B3C5HNXJ", "text": "Been an Apple fan and user, like forever. No problems with this latest MacPro. My only gripe is, nothing was wrong with my old MacPro. Apple simply stated it was no longer providing firmware updates. So no option but to buy another MacPro. Apple does this with everything; i.e. iPhones, iPads, etc. I think it's just an easy money grab to force you to keep buying Apple if you like Apple products. Also no price deal through Amazon or Apple. Both were the same price. Just easier to purchase and receive through Amazon.", "title": "It Works", "location_and_date": "Reviewed in the United States 🇺🇸 on December 16, 2022", "verified": true, "rating": "5.0"},
{"asin": "B0B3C5HNXJ", "text": "My daughter loves this product I gave her for Christmas. It works wonderfully and she is very pleased with the finished product", "title": "Amazing product", "location_and_date": "Reviewed in the United States 🇺🇸 on January 13, 2023", "verified": true, "rating": "5.0"},
{"asin": "B0B3C5HNXJ", "text": "I am so happy with this shopping is an excellent computer and am so happy . I love it", "title": "OMG I love my Mac book pro 2022", "location_and_date": "Reviewed in the United States on January 2, 2023", "verified": true, "rating": "5.0"},
{"asin": "B0B3C5HNXJ", "text": "ES INCREIBLE, LLEGO PERFECTA TODO", "title": "Perfect", "location_and_date": "Reviewed in the United States on January 13, 2023", "verified": true, "rating": "5.0"},
{"asin": "B0B3C5HNXJ", "text": "I use my MacBook more than I use my phone and it is the best laptop I have ever had great quality and I love the Touch Bar!!", "title": "I love my MacBook", "location_and_date": "Reviewed in the United States on December 28, 2022", "verified": true, "rating": "5.0"},
{"asin": "B0B3C5HNXJ", "text": "I love it! Very easy to use and clear pictures.", "title": "Love it", "location_and_date": "Reviewed in the United States on January 5, 2023", "verified": true, "rating": "5.0"},
{"asin": "B0B3C5HNXJ", "text": "This laptop computer is fast, convenient to use, light, and a real joy.", "title": "MacBook Review", "location_and_date": "Reviewed in the United States on December 31, 2022", "verified": true, "rating": "5.0"},
{"asin": "B0B3C5HNXJ", "text": "Es genial, compré la versión 512gb + 8gb de memoria ras y fluye muy bien. Además la duración de la batería es impresionante también.", "title": "Una buena inversión!", "location_and_date": "Reviewed in the United States on December 20, 2022", "verified": true, "rating": "5.0"},
{"asin": "B0B3C5HNXJ", "text": "It was Will worth it", "title": "Love it MacBook Pro laptop", "location_and_date": "Reviewed in the United States on December 23, 2022", "verified": true, "rating": "5.0"},
{"asin": "B0B3C5HNXJ", "text": "The speed of processing has improved a lot with M series. I had an Intel pro from 2014, which was struggling to process video editing even in 1024p. This one is smoooooth.", "title": "Great for video editing", "location_and_date": "Reviewed in the United States on December 1, 2022", "verified": true, "rating": "5.0"},
{"asin": "B0B3C5HNXJ", "text": "looks good will get husband will work on it.", "title": "Husband working on this", "location_and_date": "Reviewed in the United States on October 7, 2022", "verified": true, "rating": "4.0"},
{"asin": "B0B3C5HNXJ", "text": "Very good Workmanship and great quality for the price.", "title": "Fast computer", "location_and_date": "Reviewed in the United States on December 15, 2022", "verified": true, "rating": "5.0"},
{"asin": "B0B3C5HNXJ", "text": "It's not touch screen but I love it", "title": "Well its not touch screen", "location_and_date": "Reviewed in the United States on December 15, 2022", "verified": true, "rating": "5.0"},
{"asin": "B0B3C5HNXJ", "text": "I bought this computer to learn pro tools on and it is actually working for me! I now have a great work horse. Most of the pre loaded software that comes with it is amazing as well. Perfect!", "title": "Amazing work computer!", "location_and_date": "Reviewed in the United States on November 18, 2022", "verified": true, "rating": "5.0"},
{"asin": "B0B3C5HNXJ", "text": "I'm running excel, word, google drive, meet, etc. I was worried whether I'd made the wrong decision to go to a MacBook from PC. Wow, so far I am so happy with my decision. Worth the money. It does everything and just works and is a little bit snobbish about it. From a ford to a mazerati. Wow!", "title": "Ok, I get it.", "location_and_date": "Reviewed in the United States on October 27, 2022", "verified": true, "rating": "5.0"},
{"asin": "B0B3C5HNXJ", "text": "We bought this for my wife over Labor Day weekend. It was cheaper on Amazon than from Apple even with an educators discount and Amazon had it on our doorstep within 12 hours on a holiday weekend. Week done Prine.", "title": "Bought for my wife", "location_and_date": "Reviewed in the United States on November 14, 2022", "verified": true, "rating": "5.0"},
{"asin": "B0B3C5HNXJ", "text": "From PC Guy to MAC Guy! The jump was much easier than I thought. Thank goodness there’s a MAC version of all the software I used in the PC world. This MAC is a beast compared to the previous PC’s I’ve owned. Everything is much better. Battery Life, processor’s, compatibility with all my wireless peripherals. It’s almost too much. Plenty of room to grow. MacBook Pro 13in. M2 16gbRAM 1 TB SSD!…I GOT PLANS!", "title": "Jumped ship from Windows!", "location_and_date": "Reviewed in the United States on September 23, 2022", "verified": true, "rating": "5.0"},
{"asin": "B0B3C5HNXJ", "text": "My granddaughter loves all Apple products so we are buying her a lot of them. I had a medical emergency and she saved my life calling 911 so this was her gift for her heroism! We thought it had a touch screen, but it doesn't.", "title": "Very nice, but no touch screen as we thought it had.", "location_and_date": "Reviewed in the United States on November 7, 2022", "verified": true, "rating": "5.0"},
{"asin": "B0B3C5HNXJ", "text": "I've been using Chromebooks for the past few years and finally decided to get a Mac.  This machine does everything I need and much more.  It was worth the money.  It doesn't have a touchscreen but the touchpad does everything you need.  And it's incredibly fast.  It has so many features on it, and I've found it very easy to use and to learn.", "title": "Worth every penny!", "location_and_date": "Reviewed in the United States on September 25, 2022", "verified": true, "rating": "5.0"},
{"asin": "B0B3C5HNXJ", "text": "Plenty of speed and power for photo and video editing using Adobe software. My biggest complaint is that the machine has only two ports. If you are charging the machine in one port, you are left with a single port.", "title": "Excellent small laptop", "location_and_date": "Reviewed in the United States on August 9, 2022", "verified": true, "rating": "4.0"},
{"asin": "B0B3C5HNXJ", "text": "I used a macbook for my college years but once the screen broke I replaced it with windows. Going back to MacBook has been such a nice change, I can text from my laptop and the integration between phone and laptop is very convenient.", "title": "Love my macbook", "location_and_date": "Reviewed in the United States on October 21, 2022", "verified": true, "rating": "5.0"},
{"asin": "B0B3C5HNXJ", "text": "I've been used during a long time with no charging. It's very impressive because I use heavy softwares.", "title": "It's incredibly good and powerful machine!", "location_and_date": "Reviewed in the United States on November 27, 2022", "verified": true, "rating": "5.0"},
{"asin": "B0B3C5HNXJ", "text": "This computer has exceeded my expectations. The workmanship is very good. There is a display board on the keyboard that can be displayed, which can control the volume and other operations. The screen of the computer is also good, and it is very smooth to use. overall feeling very satisfied.", "title": "very fast, good screen and new design keyboard", "location_and_date": "Reviewed in the United States 🇺🇸 on October 2, 2022", "verified": true, "rating": "5.0"},
{"asin": "B0B3C5HNXJ", "text": "The product arrived on time and in great condition. I love how fast and professional this seller was. I am a happy customer :)", "title": "Fast delivery!", "location_and_date": "Reviewed in the United States 🇺🇸 on November 10, 2022", "verified": true, "rating": "5.0"},
{"asin": "B0B3C5HNXJ", "text": "Glad I splurged and got a new 2022 one. It’s so nice and will last a long time I think.", "title": "Beautiful", "location_and_date": "Reviewed in the United States 🇺🇸 on November 7, 2022", "verified": true, "rating": "5.0"},
{"asin": "B0B3C5HNXJ", "text": "I have several versions of the MacBook Pro, and this one is very fast and the picture and colors are awesome! It has a longer battery life than before and a user-friendly touch screen.  Amazing!", "title": "I am in LOVE with the New Apple MacBook Pro Laptop!", "location_and_date": "Reviewed in the United States 🇺🇸 on September 27, 2022", "verified": true, "rating": "5.0"},
{"asin": "B0B3C5HNXJ", "text": "buy one!", "title": "good", "location_and_date": "Reviewed in the United States 🇺🇸 on November 29, 2022", "verified": true, "rating": "5.0"},
{"asin": "B0B3C5HNXJ", "text": "This is definitely good laptop with M2 chip it makes it even faster. The battery performance was expected to be more but it has same battery time as previous versions.", "title": "Greate performance and good quality.", "location_and_date": "Reviewed in the United States 🇺🇸 on October 3, 2022", "verified": true, "rating": "5.0"},
{"asin": "B0B3C5HNXJ", "text": "4 th MacBook I have purchased for my college age kids! This computer is fantastic for nursing students and business major students. My daughter is extremely happy with everything about this computer!", "title": "Great computer", "location_and_date": "Reviewed in the United States 🇺🇸 on September 30, 2022", "verified": true, "rating": "5.0"},
{"asin": "B0B3C5HNXJ", "text": "Battery life is good. I don’t think it has a touch screen", "title": "Battery", "location_and_date": "Reviewed in the United States 🇺🇸 on November 8, 2022", "verified": true, "rating": "5.0"},
{"asin": "B0B3C5HNXJ", "text": "Finally got a chance to open it up during holidays and it just ate up my free time in frustration.Lets start with it only having 2 ports and one is used for charging!!!  What if you have a phone and tablet?  So immediately, I have to order a hub and have dangling around.  No hdmi, no ethernet, so now a massive hub.Started it and wanted to use migration assistant to move my data from old macbook pro, problem, usb drive is not usb-c so I need an adapter.  Another purchase.Got it finally migrated and started up, it asks to update to Macos Ventura.  Ok, go for it.  Error, failed to personalize your update.  Please try again.  What the heck, new laptop!  Tried to update a bizzion different ways based on internet and nothing works.  Please try again!  How about a more informative error msg.  Also, \"please try again\" become infuriating after a hours and dozens of tries.Called apple support, they just wanted to run down the same ways I've already covered.  Not much help, basically I'm down to 2 options: 1) reinstall macos or 2) erase entire macbook start over.  Really, this is a NEW macbook I just freaking bought.So, I'm going to try and reinstall the os after backup finishes.  If it doesn't help, then I give up and I'm returning for a refund.  What a complete waste of time.Nevermind that apple forced the purchase because latest xcode won't install unless you have the latest os, and my old macbook pro can't run latest os (even though youtubers have shown that it can run it with hack to install newer os).  Another example of apple forcing more ewaste onto the world for monetary gain only.", "title": "By far the worst macbook pro so far.", "location_and_date": "Reviewed in the United States 🇺🇸 on December 29, 2022", "verified": true, "rating": "1.0"},
{"asin": "B0B3C5HNXJ", "text": "La mejor compra que uno puede hacer !!!!!", "title": "Es un avión", "location_and_date": "Reviewed in the United States 🇺🇸 on November 4, 2022", "verified": true, "rating": "5.0"},
{"asin": "B0B3C5HNXJ", "text": "Love it, can’t beat the quality of a Mac. And it was delivered next day", "title": "Great laptop", "location_and_date": "Reviewed in the United States 🇺🇸 on October 16, 2022", "verified": true, "rating": "5.0"},
{"asin": "B0B3C5HNXJ", "text": "This laptop is an updated version of one I myself own and it was quickly set up by my grandson. He loves it!I know it will be great for him, as mine has been for me. Thanks!", "title": "Perfect for Grandson going to College", "location_and_date": "Reviewed in the United States 🇺🇸 on August 29, 2022", "verified": true, "rating": "5.0"},
{"asin": "B0B3C5HNXJ", "text": "Excellent computer. Highly recommend", "title": "Excellent computer. Highly recommend", "location_and_date": "Reviewed in the United States 🇺🇸 on November 6, 2022", "verified": true, "rating": "5.0"},
{"asin": "B0B3C5HNXJ", "text": "Purchased this device for my daughter to finish college. She absolutely loves it .", "title": "Excellent Device", "location_and_date": "Reviewed in the United States 🇺🇸 on October 1, 2022", "verified": true, "rating": "5.0"},
{"asin": "B0B3C5HNXJ", "text": "I like that it's light weight", "title": "heavy Not", "location_and_date": "Reviewed in the United States 🇺🇸 on October 18, 2022", "verified": true, "rating": "5.0"},
{"asin": "B0B3C5HNXJ", "text": "Love the Touch Bar", "title": "Great Device", "location_and_date": "Reviewed in the United States 🇺🇸 on October 28, 2022", "verified": true, "rating": "5.0"},
{"asin": "B0B3C5HNXJ", "text": "Product is without blemish and is used for academic activities.", "title": "Perfect!", "location_and_date": "Reviewed in the United States 🇺🇸 on September 15, 2022", "verified": true, "rating": "5.0"},
{"asin": "B0B3C5HNXJ", "text": "It is a great device though. If you want a small laptop then it is the right one for you .", "title": "Great", "location_and_date": "Reviewed in the United States 🇺🇸 on August 17, 2022", "verified": true, "rating": "5.0"},
{"asin": "B0B3C5HNXJ", "text": "Seamless interface", "title": "Great product", "location_and_date": "Reviewed in the United States 🇺🇸 on October 3, 2022", "verified": true, "rating": "5.0"},
{"asin": "B0B3C5HNXJ", "text": "Bought for design and music.Should be perfect…", "title": "Recycled? Who cares. It’s a Macbook.", "location_and_date": "Reviewed in the United States 🇺🇸 on September 9, 2022", "verified": true, "rating": "5.0"},
{"asin": "B0B3C5HNXJ", "text": "Excellent laptop - build quality is superb!", "title": "Best Laptop", "location_and_date": "Reviewed in the United States 🇺🇸 on September 6, 2022", "verified": true, "rating": "5.0"},
{"asin": "B0B3C5HNXJ", "text": "overall fair", "title": "overall fair", "location_and_date": "Reviewed in the United States 🇺🇸 on November 5, 2022", "verified": true, "rating": "3.0"},
{"asin": "B0B3C5HNXJ", "text": "This laptop is just what I was looking for. Service and communication was great.", "title": "Awesome product", "location_and_date": "Reviewed in the United States 🇺🇸 on August 20, 2022", "verified": true, "rating": "5.0"},
{"asin": "B0B3C5HNXJ", "text": "Work with it, watch videos for entertainment, use it, it,! Haha, competent for everything.", "title": "Its performance is very good!", "location_and_date": "Reviewed in the United States 🇺🇸 on August 14, 2022", "verified": true, "rating": "5.0"},
{"asin": "B0B3C5HNXJ", "text": "Muy buena calidad, llegó como decía  la descripción 🔥", "title": "Great computer.", "location_and_date": "Reviewed in the United States 🇺🇸 on August 26, 2022", "verified": true, "rating": "5.0"},
{"asin": "B0B3C5HNXJ", "text": "Excellent battery life", "title": "Perfect", "location_and_date": "Reviewed in the United States 🇺🇸 on September 12, 2022", "verified": true, "rating": "5.0"},
{"asin": "B0B3C5HNXJ", "text": "Very good", "title": "High quality", "location_and_date": "Reviewed in the United States 🇺🇸 on September 5, 2022", "verified": true, "rating": "5.0"},
{"asin": "B0B3C5HNXJ", "text": "Apple has taken a sharp downward spiral, their products used to be top notch, but now they fail at almost every task. Word processing tasks are abysmal, photo editing is slow at best, and multitasking is out of the question. MacBook Pro’s are now a chrome book with a fancy screen resolution. They are all fluff and no substance, which is sad when they used to be excellent for most editing and word processing jobs. As a photojournalist I expect to be able to batch edit multiple images and continue writing captions or a news article at the same time. No longer with Apple’s latest MacBook Pro. This piece of junk makes a better paper weight than it does a laptop. Don’t waste your time or money, these new products from Apple leave much to be desired. Not to mention the frustration from waiting for the text that you typed to show up on the screen ten seconds later. I am transitioning away from an all Apple setup which I have built over the past 10 years. Not by choice I must add! I am really disappointed in the quality of this computer. But the webcam worked well. LOL!", "title": "Not what Apple that once was.", "location_and_date": "Reviewed in the United States 🇺🇸 on December 29, 2022", "verified": true, "rating": "1.0"},
{"asin": "B0B3C5HNXJ", "text": "Fantastic machine. Quick, sleek and so intuitive. This is my first Mac and very impressed so far. Love the task bar too! 👍", "title": "First Mac", "location_and_date": "Reviewed in the United States 🇺🇸 on July 3, 2022", "verified": true, "rating": "5.0"},
{"asin": "B0B3C5HNXJ", "text": "So far it's perfect.", "title": "So far it’s a good computer.", "location_and_date": "Reviewed in the United States 🇺🇸 on July 23, 2022", "verified": true, "rating": "5.0"},
{"asin": "B0B3C5HNXJ", "text": "Software addition was not installed.", "title": "Additional Software Bought Not installed", "location_and_date": "Reviewed in the United States 🇺🇸 on July 20, 2022", "verified": true, "rating": "3.0"},
{"asin": "B0B3C5HNXJ", "text": "I called Amazon, and AppleCare and was told by both that I could get AppleCare on a used Apple product. When I got the computer, a macbook pro 2022, I called AppleCare, and they told me I COULD NOT GET APPLECARE. WHY? Because the ORIGINAL owner purchased it on Oct. 6th, 2022. I purchased it on Dec. 24th, 2022. The AppleCare person stated that it was outside of the 60 day window to get AppleCare....And, he directed me to the Apple.com refurbished site for a better purchase. The WORM!", "title": "Don't buy this!", "location_and_date": "Reviewed in the United States 🇺🇸 on December 30, 2022", "verified": true, "rating": "1.0"},
{"asin": "B0B3C5HNXJ", "text": "Be sure to by expensive adapters, and special Apple mouse, in order to use it.  I tried to run my favorite photo app, and the app only partially worked.  I received warnings that the app was using too much memory, and I should shut it down.  I returned it.", "title": "No SD Card port, No USB port, Not Enough Memory to Run Photo App", "location_and_date": "Reviewed in the United States 🇺🇸 on July 30, 2022", "verified": true, "rating": "2.0"},
{"asin": "B0B3C5HNXJ", "text": "As purchasing this computer there’s nothing wrong with it however the Amazon payment process got completely screwed up and I have yet been properly reimbursed for what I am owed and then able to continue on with this process I’m very upset with the Amazon processing will no longer be a customer because of this particular item", "title": "Computers fine Amazons different", "location_and_date": "Reviewed in the United States 🇺🇸 on December 24, 2022", "verified": true, "rating": "1.0"},
{"asin": "B0B3C5HNXJ", "text": "It’s really slow. I wish I would not have purchased.", "title": "Slooooooow!", "location_and_date": "Reviewed in the United States 🇺🇸 on January 3, 2023", "verified": true, "rating": "1.0"},
{"asin": "B0B3C5HNXJ", "text": "Apple doing apple things… there is no USB ports on this… like what..", "title": "NO USB PORTS", "location_and_date": "Reviewed in the United States 🇺🇸 on October 15, 2022", "verified": true, "rating": "1.0"},
{"asin": "B0B3C5HNXJ", "text": "Video crashed during setup. How did this unit make it out of the factory?!At least they took it back.", "title": "Video crashed on setup!", "location_and_date": "Reviewed in the United States 🇺🇸 on August 25, 2022", "verified": true, "rating": "1.0"},
{"asin": "B0B3C5HNXJ", "text": "I dislike smashed parcels", "title": "was delivered smashed", "location_and_date": "Reviewed in the United States 🇺🇸 on August 20, 2022", "verified": true, "rating": "1.0"},
{"asin": "B0B3C5HNXJ", "text": "Performance same as older version", "title": "Not as expected", "location_and_date": "Reviewed in the United States 🇺🇸 on October 20, 2022", "verified": true, "rating": "1.0"},
{"asin": "B0B3C5HNXJ", "text": "The screen came chipped.", "title": "Cheap product", "location_and_date": "Reviewed in the United States 🇺🇸 on November 7, 2022", "verified": true, "rating": "1.0"}
]