[
{"asin": "B09MVZH5RB", "text": "Love the edge screen and thesize", "title": "Great phone.", "location_and_date": "Reviewed in the United States 🇺🇸 on March 12, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09MVZH5RB", "text": "Got my husband this phone as an early birthday/Christmas gift. He’s never had a phone that cost more than $400 and this present came as a big surprise. After seeing the camera and screen quality, I’m probably going to jump ship on the iPhone bandwagon I’ve been on for the last decade once I’m up for an upgrade. I seriously cannot emphasize how great the picture quality is and the sound is incredible. I downloaded tiktok and snapchat on it, to see if posted videos lagged (like all typical androids) but they actually looked crispier on the 22+ Ultra than my iPhone 13+… Only downside that my husband immediately noticed was the size and mentioned how probable a drop was going to be, but I got him a durable case and popsocket that’s hopefully helps mitigate that. He won’t stop thanking me for the gift so it’s safe to say that this was worth the investment! Now the only reason why I’m unwilling to rate it 5 stars is because the 45W charger isn’t included with the phone to aid fast battery charging and Samsung downgraded the ram from 12GB to 8GB from last year’s Galaxy S21 5G Ultra… obviously not a big difference but these changes just prove the company wants to siphon more money out of consumers.", "title": "5 Star Quality but 4 Star Overall", "location_and_date": "Reviewed in the United States 🇺🇸 on November 20, 2022", "verified": true, "rating": "4.0"},
{"asin": "B09MVZH5RB", "text": "Battery drain so fast . Other than that  is amazing", "title": "Battery drain so fast . Other than that  is amazing", "location_and_date": "Reviewed in the United States 🇺🇸 on March 9, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09MVZH5RB", "text": "I love my new phone. It came with a bar code to scan that took you straight to the app needed to do the mobile transfer.  I love everything about the phone.", "title": "Samsung Galaxy S22 Ultra", "location_and_date": "Reviewed in the United States 🇺🇸 on February 14, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09MVZH5RB", "text": "It's a pretty huge phone, the s pen works really well so the phone can also function as a tablet.  I have used it for 2 months now and I don't have a problem with it!", "title": "It's huge and I love it", "location_and_date": "Reviewed in the United States 🇺🇸 on February 11, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09MVZH5RB", "text": "Me compre este galaxy s22 ultra  como regalo de navidad para  remplazar mi viejo celular y vino en perfectas condiciones y me encanta.", "title": "El mejor regalo de navidad!", "location_and_date": "Reviewed in the United States 🇺🇸 on January 21, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09MVZH5RB", "text": "La batería dura muchísimo el enfoque de la cámara es excelente y el reconocimiento facial es el mejor ... 5 estrellas 🌟", "title": "Excelente teléfono lo amo 💕", "location_and_date": "Reviewed in the United States 🇺🇸 on January 21, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09MVZH5RB", "text": "Recomendado 👍🏼", "title": "Hermoso 🤩", "location_and_date": "Reviewed in the United States 🇺🇸 on February 4, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09MVZH5RB", "text": "Simple to set up.  Buy it unlocked and use a less expensive provider like Mint.", "title": "Arrived well packaged. Moved my Mint SIM card and let the phone do the rest.  Easy Peasy!", "location_and_date": "Reviewed in the United States 🇺🇸 on January 23, 2023", "verified": true, "rating": "5.0"},
{"asin": "B09MVZH5RB", "text": "Package arrived when expected in immaculate condition. The performance of the phone is as the many reviews say but what stands out is the eSim capability. Given that the dual sim variant is a few hundred more than this phone I'd definitely recommend going this way if your providers offer eSims.", "title": "What a powerhouse of a device.", "location_and_date": "Reviewed in the United States 🇺🇸 on December 29, 2022", "verified": true, "rating": "5.0"}
]